OdDAI.WhereRule.expression
\details
Returns an expression of the Where Rule.
\returns Returns an expression of the Where Rule.

OdDAI.WhereRule.validate(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Schema!System.Runtime.CompilerServices.IsConst*)
\details

OdDAI.WhereRule.validate(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst)
\details

OdDAI.WhereRule.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.WhereRule.originalLabel
\details
Returns an original label of the Where Rule in form which it presents in schema.

OdDAI.WhereRule.label
\details
Returns a label of the Where Rule.

OdDAI.WhereRule.Dispose
\details
Destructor.

OdDAI.WhereRule
\details
This class represents a where rule for instance validation pourposes.